TEXT_RU: dict[str, str] = {
    'Abs': 'Конспект лекция 📜',
    'Man': 'Методички 📖',
    'HW': 'Домашнее задание ✍',
    'DMan': 'Загрузка файлов ✍',
    'CHW': 'Проверка домашнего задания 📖',
    'start': 'Приветствую тебя, пользователь! \nТы зашел в бот Адаптер. \nЯ ждал только тебя :).\nДля продолжения вызови меню с помощью команды /menu',
    'Astart': 'Добро пожаловать домой, мастер! \nБот работает в штатном режиме и ждет ваших указаний!\nДля продолжения вызовите меню с помощью команды /menu',
    'menu': 'Ты вызвал меню (Как неожиданно)!\nТеперь выбери на панели снизу, что ты хочешь сделать.'
            '\nВарианты очевидны, но я всё же поясню :).'
            '\n<b>Домашняя работа:</b> здесь ты можешь скинуть дз с адаптерства на проверку;'
            '\n<b>Методички:</b> очевидно, здесь ты найдешь все методички'
            '\n<b>Конспекты лекций:</b> очевидно, здесь ты найдешь конспекты лекций',
    'Amenu': 'Вы вызвали меню для боссов. Выберите на панели снизу, что хотите сделать.'
             '\nПоясню,пожалуй, все варианты.'
             '\n<b>Проверка домшней работы:</b> здесь можно проверить домашнюю работу!'
             '\n<b>Загрузка файлов:</b> как черная дыра поглащает любые файлы для вас.',
    '/help': 'Этот бот создан в рамках проектной сессии '
             'для помощи Адаптерам и Руководителям!\n'
             'Теперь не надо искать по чатам конспекты и методички! '
             'Не надо искать человека, которому ты должен скинуть дз! '
             'Всё просто и легко.',
    'other_answer': 'Извините, но, увы, это сообщение мне непонятно...',
    'reg': 'Упс! Ты не зарегистрирован! Давай исправим это.\nВведи комманду: /registration\nИначе доступ к боту не получишь.',
    'Fcancel' : 'Вы вышли из машины состояний\n\n'
                              'Чтобы снова перейти к заполнению анкеты - '
                              'отправьте команду /registration',
    'Scancel' : 'Отменять нечего. Вы вне машины состояний\n\n'
                              'Чтобы перейти к заполнению анкеты - '
                              'отправьте команду /registration',
    'name' : 'Пожалуйста, введите ваше ФИО:',
    'ConA' : 'Вы официально Адаптер. Поздравляю!',
    'ConfR': "Регистрация пользователя подтверждена!",
    'FCon' : 'Вам не одобрили регистрацию. Гуляйте',
    'FConfR': "Отказ в регистарции пользователя подтвержден!",
    'Group' : 'Спасибо!\n\nА теперь введите номер вашей группы',
    'NotAName' : 'То, что вы отправили не похоже на имя\n\n'
                              'Пожалуйста, введите ваше имя\n\n'
                              'Если вы хотите прервать регистрацию - '
                              'отправьте команду /cancel',
    'MFC' : 'Спасибо!\n\nТеперь мы отправим сообщение руководителю, чтобы подтвердить, что вы Адаптер! Ожидайте подтверждения.',
    'NotAGroup' : 'Что-то непохоже на номер группы.\n\n'
             'Попробуйте еще раз\n\nЕсли вы хотите прервать '
             'заполнение анкеты - отправьте команду /cancel'
    }
